app/controllers/line_items_controller.rb

  def create
    product=Product.find(params[:product_id])
    @line_item=@cart.add_item(product.id)
    #@line_item = LineItem.new(line_item_params)

    respond_to do |format|
      if @line_item.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 10]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-06-07 02:08:37.136399"], ["updated_at", "2015-06-07 02:08:37.136399"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 10], ["cart_id", 1], ["created_at", "2015-06-07 02:08:37.462417"], ["updated_at", "2015-06-07 02:08:37.462417"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 4], ["updated_at", "2015-06-07 02:46:41.417052"], ["id", 5]]