app/controllers/products_controller.rb

 def index
    if params[:search]
      @products = Product.search(params[:search]).order("created_at DESC")
---
SELECT "products".* FROM "products" WHERE (name like '%ffee%')  ORDER BY created_at DESC

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "image", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)