app/controllers/shopper_controller.rb

SELECT "products".* FROM "products" WHERE (name like '%progr%')  ORDER BY created_at DESC
---
  def index
  	@products = Product.order(:name)