app/controllers/users_controller.rb

  def index
    #@users = User.all
     @users = User.order(:name)
---
SELECT "users".* FROM "users"  ORDER BY "users"."name" ASC